Read and write to excel

In [3]:
import pandas as pd

In [13]:
df = pd.read_csv('stock_data.csv')
df

  stock_data     Unnamed: 1 Unnamed: 2 Unnamed: 3     Unnamed: 4
0    tickers            eps    revenue      price         people
1      GOOGL          27.82         87        845     larry page
2        WMT           4.61        484         65           n.a.
3       MSFT             -1         85         64     bill gates
4       RIL   not available         50       1023  mukesh ambani
5       TATA            5.6         -1       n.a.     ratan tata

to skip the first row or any row

In [10]:
df = pd.read_csv('stock_data.csv',skiprows=1)
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [15]:
df = pd.read_csv('stock_data.csv',header=1)
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

index starts from 0 hence header=1 eally means row#2 in csv file

In [17]:
df = pd.read_csv('stock_data.csv',header=None)
df

         0              1        2      3              4
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

to provide the name

In [19]:
df = pd.read_csv('stock_data.csv',header=None, names=["One","Two","Three","Four"])
df

                   One      Two  Three           Four
tickers            eps  revenue  price         people
GOOGL            27.82       87    845     larry page
WMT               4.61      484     65           n.a.
MSFT                -1       85     64     bill gates
RIL      not available       50   1023  mukesh ambani
TATA               5.6       -1   n.a.     ratan tata

In [ ]:
df = pd.read_csv('stock_data.csv' , nrows=3) # if you want to read only three rows excluding header
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [ ]:
df = pd.read_csv('stock_data.csv' , nrows=3)
df